Revit 2024 API
BuiltInFailures.RoomFailures.ExtensionsOverlapWarning Property
 Vertical Extensions on these Walls overlap. This can cause undesirable Joins. Try starting with no overlap and extend the Walls toward one another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ExtensionsOverlapWarning { get; }
Visual Basic
Public Shared ReadOnly Property ExtensionsOverlapWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ExtensionsOverlapWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace